Revit 2027 API
FabricationServiceButton.GetConditionUpperValue Method
 Gets the condition upper value (valid if less) for a given condition index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetConditionUpperValue(
	int condition
)
Public Function GetConditionUpperValue (
	condition As Integer
) As Double
public:
double GetConditionUpperValue(
	int condition
)
member GetConditionUpperValue :
        condition : int -> float
Parameters
condition Int32
 The condition index.
Return Value
Double
 The condition upper value.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
Remarks
 A value of -1 indicates an unrestricted value.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace